ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/touch/touch_detect.c
    }
}

void touch_detect_init(void) {
  ADI_OSAL_STATUS eOsStatus;

  /* Initialize app state */
  g_state_ad7156.num_subs = 0;
  g_state_ad7156.num_starts = 0;

  AD7156_Init();
  /* Create touch thread */
  touch_task_attributes.pThreadFunc = touch_detect_thread;
  touch_task_attributes.nPriority = APP_OS_CFG_TOUCH_TASK_PRIO;
  touch_task_attributes.pStackBase = &touch_task_stack[0];
  touch_task_attributes.nStackSize = APP_OS_CFG_TOUCH_TASK_STK_SIZE;
  touch_task_attributes.pTaskAttrParam = NULL;
  touch_task_attributes.szThreadName = "touch";
  touch_task_attributes.pThreadTcb = &touch_task_tcb;

  eOsStatus = adi_osal_MsgQueueCreate(&touch_task_msg_queue,NULL,
                                    9);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
  else
  {
    update_task_queue_list(APP_OS_CFG_TOUCH_TASK_INDEX,touch_task_msg_queue);
  }

  eOsStatus = adi_osal_ThreadCreateStatic(&touch_task_handler,
                                    &touch_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
}

void send_message_top_touch_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(touch_task_msg_queue,p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(touch_detect_task_evt_sem);
}

m2m2_hdr_t *ad7156_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_in_payload);
  // Allocate a response packet with space for the correct number of operations
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if(NULL != p_resp_pkt)
  {
      PYLD_CST(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_resp_payload);
      uint8_t  reg_data = 0;

      switch (p_in_payload->command) {
      case M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ:
        for (int i = 0; i < p_in_payload->num_ops; i++) {
          AD7156_GetRegisterValue((uint8_t *)&reg_data, (uint8_t)p_in_payload->ops[i].address, 1);
          status = M2M2_APP_COMMON_STATUS_OK;
          p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
          p_resp_payload->ops[i].value = reg_data;
        }
        p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_READ_REG_16_RESP;
        break;
      case M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ:
        for (int i = 0; i < p_in_payload->num_ops; i++) {
          AD7156_SetRegisterValue(p_in_payload->ops[i].value, (uint8_t)p_in_payload->ops[i].address, 1);
          status = M2M2_APP_COMMON_STATUS_OK;
          p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
          p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
        }
        p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_RESP;
        break;
      default:
        // Something has gone horribly wrong.
        post_office_consume_msg(p_resp_pkt);
        return NULL;
      }
      p_resp_pkt->dest = p_pkt->src;
      p_resp_pkt->src = p_pkt->dest;
      p_resp_payload->num_ops = p_in_payload->num_ops;
      p_resp_payload->status = status;
  }

  return p_resp_pkt;
}

static m2m2_hdr_t *ad7156_app_load_cfg(m2m2_hdr_t *p_pkt) {
  // Declare and malloc a response packet
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_ad7156_resp_t, 0);
  // Declare a pointer to the response packet payload
  PYLD_CST(p_resp_pkt, m2m2_sensor_ad7156_resp_t, p_resp_payload);
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

  if (!load_ad7156_cfg()) {  // Loads the device configuration
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
  } else {
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
  }

  p_resp_payload->command = M2M2_SENSOR_AD7156_COMMAND_LOAD_CFG_RESP;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  return p_resp_pkt;
}

/**
 * @brief  returns the AD7156 stream status
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *ad7156_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    if (g_state_ad7156.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }
    p_resp_payload->stream = M2M2_ADDR_SENSOR_AD7156_STREAM;
    p_resp_payload->num_subscribers = g_state_ad7156.num_subs;
    p_resp_payload->num_start_reqs = g_state_ad7156.num_starts;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  Handles start/stop/sub/unsub of ad7156 data streams commands
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for stream start/stop/sub/unsub operations
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *ad7156_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t command;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

