ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/touch/touch_detect.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
      if (g_state_ad7156.num_starts == 0) {
        if (!load_ad7156_cfg()) {
          Debug_Handler(); /* exception handler */
        }
        g_state_ad7156.num_starts = 1;
#ifdef ENABLE_WATCH_DISPLAY
        /* Lower the Display refresh rate, so that top touch is stable */
        lcd_extcomin_status_set(DISPLAY_REVERSE_LOW);
#endif
         /* Disable low touch application during AD7156 stream */
#ifdef LOW_TOUCH_FEATURE
        EnableLowTouchDetection(false);
#endif
        Register_out1_pin_detect_func(out_pin1_detect);
        Register_out2_pin_detect_func(out_pin2_detect);
        top_touch_func_set(1);
        bottom_touch_func_set(1);
        status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
      } else {
        g_state_ad7156.num_starts++;
        status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
      break;
    case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
       if (0 == g_state_ad7156.num_starts) {
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else if (1 == g_state_ad7156.num_starts){
          g_state_ad7156.num_starts = 0;
          Unregister_out1_pin_detect_func(out_pin1_detect);
          Unregister_out2_pin_detect_func(out_pin2_detect);
          top_touch_func_set(0);
          bottom_touch_func_set(0);
#ifdef ENABLE_WATCH_DISPLAY
          /* Revert the Display refresh rate change done for AD7156 stream start */
          lcd_extcomin_status_set(DISPLAY_REVERSE_HIGH);
#endif
          /* Re-enable low touch application when AD7156 stream is stopped*/
#ifdef LOW_TOUCH_FEATURE
        EnableLowTouchDetection(true);
#endif
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else {
        g_state_ad7156.num_starts--;
        status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
      break;
    case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
      g_state_ad7156.num_subs++;
      if(g_state_ad7156.num_subs == 1)
      {
         /* reset pkt sequence no. only during 1st sub request */
         g_state_ad7156.data_pkt_seq_num = 0;
      }
      post_office_setup_subscriber(M2M2_ADDR_SENSOR_AD7156,
          M2M2_ADDR_SENSOR_AD7156_STREAM, p_pkt->src, true);
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
      command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
      break;
    case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
      if (g_state_ad7156.num_subs <= 1) {
        g_state_ad7156.num_subs = 0;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      } else {
        g_state_ad7156.num_subs--;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(M2M2_ADDR_SENSOR_AD7156,
          M2M2_ADDR_SENSOR_AD7156_STREAM, p_pkt->src, false);
      command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      post_office_consume_msg(p_resp_pkt);
      return NULL;
      break;
    }
    p_resp_payload->command = command;
    p_resp_payload->status = status;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*************************/

#ifdef DCB
static m2m2_hdr_t *ad7156_dcb_command_read_config(m2m2_hdr_t *p_pkt)
{
    static uint16_t r_size = 0;
    uint32_t dcbdata[MAXAD7156DCBSIZE];
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_ad7156_data_t, 0);
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_ad7156_data_t, p_resp_payload);

    r_size = (uint16_t)MAXAD7156DCBSIZE;
    if(read_ad7156_dcb(&dcbdata[0],&r_size) == AD7156_DCB_STATUS_OK)
    {
        for(int i=0; i< r_size; i++)
          p_resp_payload->dcbdata[i] = dcbdata[i];
        p_resp_payload->size = (r_size);
        status = M2M2_DCB_STATUS_OK;
    }
    else
    {
        p_resp_payload->size = 0;
        status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    return p_resp_pkt;
}

static m2m2_hdr_t *ad7156_dcb_command_write_config(m2m2_hdr_t *p_pkt)
{
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
    uint32_t dcbdata[MAXAD7156DCBSIZE];

    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, m2m2_dcb_ad7156_data_t, p_in_payload);
    PKT_MALLOC(p_resp_pkt, m2m2_dcb_ad7156_data_t, 0);
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_ad7156_data_t, p_resp_payload);

    for(int i=0; i<p_in_payload->size; i++)
      dcbdata[i] = p_in_payload->dcbdata[i];
    if(write_ad7156_dcb(&dcbdata[0],p_in_payload->size) == AD7156_DCB_STATUS_OK)
    {
        ad7156_set_dcb_present_flag(true);
        status = M2M2_DCB_STATUS_OK;
    }
    else
    {
        status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(int i=0; i<MAXAD7156DCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    return p_resp_pkt;
}

static m2m2_hdr_t *ad7156_dcb_command_delete_config(m2m2_hdr_t *p_pkt)
{
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_ad7156_data_t, 0);
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_ad7156_data_t, p_resp_payload);

    if(delete_ad7156_dcb() == AD7156_DCB_STATUS_OK)
    {
        ad7156_set_dcb_present_flag(false);
        status = M2M2_DCB_STATUS_OK;
    }
    else
    {
        status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(int i=0; i<MAXAD7156DCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    return p_resp_pkt;

}
#endif